---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException
source: html/de62379e-b515-e37e-712a-706b791f2340.htm
---
# OptionalFunctionalityNotAvailableException Members

Retrieves data needed to serialize the target object.